{"content": ["1. If a merit system is adopted, no person in the classified service of the city or seeking admission thereto shall be appointed, promoted, demoted, removed, or in any way favored or discriminated against because of his political or religious opinions or affiliations or any other factors not related to ability to perform the work; no person shall willfully or corruptly commit or attempt to commit any fraud preventing the impartial execution of the personnel provisions of this Charter or of the rules and regulations made thereunder; no person seeking appointment to or promotion in the classified service of the city shall either directly or indirectly give, render, or pay any money, service, or other valuable thing to any person for or on account of or in connection with his appointment, proposed appointment, promotion, or proposed promotion", "1. No person in the classified service of the city shall participate in political activity during working hours or while representing the city in an official capacity. Any member of the classified service who is elected or appointed as mayor or a member of the city council must resign their position with the classified service prior to taking office.", "1. Any person who by himself or with others willfully or corruptly violates any of the provisions of this section shall be guilty of a misdemeanor and shall, upon conviction thereof, be punished by a fine of not more than one hundred dollars ($100.00), or by imprisonment for a term not exceeding thirty (30) days, or by both such fine and imprisonment. Any person who is convicted under this section shall for a period of five (5) years be ineligible for appointment to or employment in a position in the city service, and shall, if he be an officer or employee of the city, immediately forfeit the office or position he holds."], "note": null, "history": "(Res. No. CA-1-09, § 1, 1-5-09, eff. 2-24-09)", "number": "61", "title": "Prohibitions and restrictions regarding persons in classified service."}