{"content": ["In addition to any other borrowing power which the city may presently have, from whatever source derived, and notwithstanding any other provision or limitation of public general or public local law, the city shall have the power to borrow money and incur indebtedness, from time to time, for any public purpose, in anticipation of the collection of taxes or revenues, or both, direct or indirect, and to issue tax anticipation notes, notes in the nature of commercial paper or other evidences of indebtedness (hereinafter collectively referred to as \"notes\") which shall be a first lien upon the proceeds of such taxes and revenues. All notes shall be authorized by ordinance, which ordinance shall not be subject to the referendum provision of section 12 of this Charter and shall be fully effective upon its final passage. The council shall have the power to determine by such ordinance the form and terms and all other matters concerning the issuance and sale of notes, including, without limitation:", "1. The manner of sale of such notes, which may be by private negotiation without notice of sale or solicitation of competitive bids;", "1. The purchase price for such notes, which may be at, above or below the par value thereof;", "1. The medium of payment therefor, which may be cash or other consideration;", "1. The rate or rates of interest payable thereon, which may vary from time to time; such notes may be non-interest bearing;", "1. The date or dates of maturity of such notes, provided, however, that no notes shall mature later than eighteen months from their respective dates of issue; and", "1. Any additional security for such notes, including, but not limited to, a trust indenture with a corporate trustee or trustees, which may be any trust company or a bank having the powers of a trust company within or without the state, a letter of credit, line of credit or any other credit arrangement with a bank or lending institution."], "note": null, "history": "(Res. No. CA-4-82, § 1)", "number": "54", "title": "Borrowing in anticipation of taxes and revenues."}